---
title: Example log table queries for AADServicePrincipalSignInLogs
description:  Example queries for AADServicePrincipalSignInLogs log table
ms.topic: generated-reference
ms.service: azure-monitor
ms.author: edbaynash
author: EdB-MSFT
ms.date: 04/14/2025

# This file is automatically generated. Changes will be overwritten. Do not change this file directly. 

---

# Queries for the AADServicePrincipalSignInLogs table

For information on using these queries in the Azure portal, see [Log Analytics tutorial](/azure/azure-monitor/logs/log-analytics-tutorial). For the REST API, see [Query](/azure/azure-monitor/logs/api/overview).


### Most active service principals  


Gets list of top 100 most active service principals for the last day.  

```query
AADServicePrincipalSignInLogs
| where TimeGenerated > ago(1d)
| summarize CountPerServicePrincipal = count() by ServicePrincipalId
| order by CountPerServicePrincipal desc
| take 100
```



### Inactive service principals  


Service principals that had no sign-ins for the last 30d.  

```query
AADServicePrincipalSignInLogs
| where TimeGenerated > ago(90d)
| where ResultType == 0
| summarize LastSignIn = max(TimeGenerated) by ServicePrincipalId
| where LastSignIn < ago(30d)
```

